# Отримання даних від користувача та перетворення введених рядків у відповідні числові типи (int та float)
a = int(input('Введіть ціле число:'))
b = int(input('Введіть ціле число:'))
c = float(input('Введіть десятковий дріб:'))
d = float(input('Введіть десятковий дріб:'))

# Математичні операції
d1 = a + b
d2 = a - c
d3 = a * d
d4 = a / d
d5 = round(a ** c, 2) # піднесення до степеня, результат округлено до двох знаків після коми
d6 = (b // d) # цілочисельне ділення (наприклад, 7 // 2 дасть 3, а не 3.5)
d7 = round(d % b, 2) # остача від ділення, результат округлено до двох знаків після коми

# Формування списку з отриманих результатів
results_list = [d1, d2, d3, d4, d5, d6, d7]

print('Результати виконаних операцій:', results_list)

# Функція len() повертає загальну кількість елементів у списку
print('Кількість елементів списку', len(results_list))

# Зріз [1::2]: виведення елементів, починаючи з другого (індекс 1),
# із кроком 2 (виведе елементи з індексами 1, 3, 5)
print('Парні елементи списку', results_list[1::2])

# Обмін місцями другого (індекс 1) та п'ятого (індекс 4) елементів списку
x = results_list[1]
results_list[1] = results_list[4]
results_list[4] = x
print('Список із зміненими елементами:', results_list)

# Використання f-рядків для підставлення значень змінних безпосередньо в текст
name = input("Введіть ім'я: ")
gr = input("Введіть групу: ")
print(f'Лабораторну роботу №1 виконав {name}, студент групи {gr}.\n '
      f'Висновок: в ході виконання лабораторної роботи було опрацьовано '
      f'алгоритми послідовної (лінійної) структури, з процедурами запуску програм, '
      f'які реалізують ці алгоритми на мові Python.\n '
      f'Було засвоєно роботу з інтегрованим середовищем розробки – '
      f'integrated development environment (IDLE).')