# Отримання даних від користувача та перетворення введених рядків у відповідні числовий тип
import math

a = float(input('Введіть десятковий дріб:'))
b = float(input('Введіть десятковий дріб:'))

# Математичні операції
d1 = a + b
d2 = a - b
d3 = a * b
d4 = a / b
d5 = round(a ** b, 2) # піднесення до степеня, результат округлено до двох знаків після коми
d6 = (a // b) # цілочисельне ділення (наприклад, 7 // 2 дасть 3, а не 3.5)
d7 = round(a % b, 2) # остача від ділення, результат округлено до двох знаків після коми

# Формування списку з отриманих результатів
results_list = [d1, d2, d3, d4, d5, d6, d7]

print('Результати виконаних операцій:', results_list)

# Знаходження гіпотенузи
hip = math.sqrt(a**2 + b**2)
print('Гіпотенуза: ', hip)


