a = int(input('Введіть ціле число:'))


if a > 0:
    print('Число ',a, 'є додатнім')
elif a == 0:
    print('Число ',a, 'є нульовим')
else:
    print('Число ',a, 'є від\'ємним')

# тернарний оператор
result = 'є парним' if a % 2 == 0 else 'є непарним'
print('Число ',a, result)


if a % 3 == 0 and a % 5 == 0:
    print('Число ',a, 'ділиться на 3 і на 5')
elif a % 3 == 0 and a % 5 != 0:
    print('Число ',a, 'ділиться на 3 але не на 5')
elif a % 3 != 0 and a % 5 == 0:
    print('Число ',a, 'ділиться на 5 але не на 3')
else:
    print('Число ',a, 'не ділиться на 5 і на 3')


month = int(input('Введіть номер місяця:'))

match month:
    case 1:
        print("Місяць: Січень. Кількість днів: 31. Пора року: Зима")
    case 2:
        print("Місяць: Лютий. Кількість днів: 28. Пора року: Зима")
    case 3:
        print("Місяць: Березень. Кількість днів: 31. Пора року: Весна")
    case 4:
        print("Місяць: Квітень. Кількість днів: 30. Пора року: Весна")
    case 5:
        print("Місяць: Травень. Кількість днів: 31. Пора року: Весна")
    case 6:
        print("Місяць: Червень. Кількість днів: 30. Пора року: Літо")
    case 7:
        print("Місяць: Липень. Кількість днів: 31. Пора року: Літо")
    case 8:
        print("Місяць: Серпень. Кількість днів: 31. Пора року: Літо")
    case 9:
        print("Місяць: Вересень. Кількість днів: 30. Пора року: Осінь")
    case 10:
        print("Місяць: Жовтень. Кількість днів: 31. Пора року: Осінь")
    case 11:
        print("Місяць: Листопад. Кількість днів: 30. Пора року: Осінь")
    case 12:
        print("Місяць: Грудень. Кількість днів: 31. Пора року: Зима")
    case _:
        print("Некоретно введено номер місяця")